Revit 2027 API
ExternalDefinition Methods
The ExternalDefinition type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDataType |  Gets a ForgeTypeId identifying the data type describing values of the parameter.
(Inherited from Definition)
GetGroupTypeId |  Returns the identifier of the parameter definition's parameter group.
(Overrides Definition.GetGroupTypeId())
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExternalDefinition Class
Autodesk.Revit.DB Namespace